app/controllers/microposts_controller.rb

    def create
        @micropost = current_user.microposts.build(params[:micropost])
            if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "photo_content_type", "photo_file_name", "photo_file_size", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)