app/controllers/users_controller.rb

    def index
        @users = User.paginate(:page => params[:page], :per_page => 1)
---
SELECT "users".* FROM "users" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"

    def show
        @user = User.find(params[:id])
        @microposts = @user.microposts.paginate(:page => params[:page], :per_page => 3)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1

    def create
        @user = User.new(params[:user])
        if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        @user = User.find(params[:id])
            if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "email" = 'dennisksumlin@gmail.com', "updated_at" = '2012-04-07 20:41:59.857255' WHERE "users"."id" = 1